resume/resume_cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-21 Mon 22:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>陈烨玮</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="chrischen" />
<link rel="stylesheet" type="text/css" href="resume.css" />
</head>
<body>
<div id="content">
<h1 class="title">陈烨玮</h1>
<div class="org-center">
<p>
13651824760<br />
chrischen3121@gmail.com<br />
<a href="https://github.com/chrischen3121">https://github.com/chrischen3121</a><br />
</p>
</div>
<div id="outline-container-org167da79" class="outline-2">
<h2 id="org167da79"><span class="underline">技能</span></h2>
<div class="outline-text-2" id="text-org167da79">
<ul class="org-ul">
<li>精通 python；有后台开发经验和数据采集清洗经验</li>
<li>精通 C++11；有分布式实时交易系统开发经验</li>
<li>4 年金融行业从业经验（ETF 套利、期货套利相关背景）</li>
<li>有项目管理经验</li>
<li>有 10 人以上团队管理经验</li>
<li>有测试驱动开发经验</li>
<li><p>
技术总结
</p>

<p>
STL, boost, twisted, scrapy, numpy, pandas, scipy, sympy, git, pyqt4, linux, emacs,
elisp, cmake, zeromq, gtest/gmock, protobuf, Flask, hdf5, MySQL, redis, MongoDB,
SQLAlchemy, docker
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org4dc9393" class="outline-2">
<h2 id="org4dc9393"><span class="underline">工作经历</span></h2>
<div class="outline-text-2" id="text-org4dc9393">
</div>
<div id="outline-container-orgce08774" class="outline-3">
<h3 id="orgce08774"><i>2016.5-至今</i> 系统架构设计师&#xa0;&#xa0;&#xa0;<span class="tag"><span class="_____________">上海寻宝图资产管理有限公司</span></span></h3>
<div class="outline-text-3" id="text-orgce08774">
<p>
创业公司，主要业务是针对高净值客户的海外资产配置。
</p>
<ul class="org-ul">
<li>设计并主导开发分布式量化交易系统</li>
<li>设计并开发金融数据平台，提供 RESTful API（历史）、websocket（实时） 接口供前端调用</li>
<li>开发多个金融数据爬虫程序</li>
<li>做过期货统计套利策略的回测、实盘代码实现及问题追踪</li>
</ul>
</div>
</div>

<div id="outline-container-org7f0aea6" class="outline-3">
<h3 id="org7f0aea6"><i>2014.7-2016.4</i> 总经理助理 深圳礼一投资有限公司</h3>
<div class="outline-text-3" id="text-org7f0aea6">
<p>
礼一投资是 ETF 实时套利领域国内顶尖的私募基金。
</p>
<ul class="org-ul">
<li>带领 5 人开发团队用 C++重构原有 python 交易系统，提升整体性能表现</li>
<li>开发基础代码库，处理通信协议封装、业务心跳等功能</li>
<li>开发对接期货 CTP 接口的模块</li>
<li>负责分公司团队建设、招聘、开发人员业绩考评等常规管理工作</li>
</ul>
</div>
</div>

<div id="outline-container-orgc414368" class="outline-3">
<h3 id="orgc414368"><i>2008.1-2014.6</i> 开发组长 上海光电医用电子仪器有限公司</h3>
<div class="outline-text-3" id="text-orgc414368">
<p>
上海光电医用电子仪器有限公司是一家全日资业界领先的医疗电子仪器制造商。
</p>
<ul class="org-ul">
<li>实现医疗设备与系统的数据交换(socket, COM)</li>
<li>实现与多种医院主干系统的集成</li>
<li>分析客户需求，提出过多个用户体验优化方案</li>
<li>带领 2-3 人小组做系统的现场部署及客户培训</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2a7b5e1" class="outline-2">
<h2 id="org2a7b5e1"><span class="underline">项目经验</span></h2>
<div class="outline-text-2" id="text-org2a7b5e1">
</div>
<div id="outline-container-org4a490f4" class="outline-3">
<h3 id="org4a490f4"><i>2016.5-至今</i> 智能投顾系统</h3>
<div class="outline-text-3" id="text-org4a490f4">
<p>
系统根据客户的风险偏好通过策略模型自动生成个性化的资产配置方案。
</p>
<ul class="org-ul">
<li>实现自编指数、ETF 组合的历史及实时后复权行情</li>
<li>通过使用多进程及 pypy，解决了计算密集型 python 程序的性能瓶颈问题</li>
<li>解决 pypy 中对象相互引用时无法正确释放内存的问题</li>
<li>使用过的专业机构数据接口有万得、彭博、IB、CTP、quandl、yahoo</li>
<li>爬虫数据来源有：etf.com, nasdaq, morningstar, eoddata, 链家, 香港保险建议书</li>
<li>爬取香港保险建议书时，通过对保险公司客户端抓包分析模拟客户端行为成功爬得数据</li>
<li>对于高频数据入库，通过异地冗余服务以及盘后自动校正，保证数据的完整性和准确性</li>
</ul>
</div>
</div>

<div id="outline-container-org97148a4" class="outline-3">
<h3 id="org97148a4"><i>2016.5-2017.1</i> 商品期货交易系统</h3>
<div class="outline-text-3" id="text-org97148a4">
<ul class="org-ul">
<li>实现多种高级订单逻辑，包括自动撤补单、双腿挂单、双腿吃单等</li>
<li>实现连续合约的历史行情拼接，包括主力连续、次主力连续、到期月连续等</li>
<li>设计了策略层抽象，使得其他策略容易集成进系统，但没有做成插件形式，仍有改进空间</li>
<li>写过期货跨期套利策略的回测，回测结果与实盘表现相近</li>
<li>用 pyqt4 开发了交易界面，实现了策略调参、策略实时监控等功能</li>
</ul>
</div>
</div>

<div id="outline-container-org8669920" class="outline-3">
<h3 id="org8669920"><i>2014.7-2015.10</i>   高频量化交易系统（礼一时期）</h3>
<div class="outline-text-3" id="text-org8669920">
<p>
公司核心高频交易系统，每日承载交易量约 2000 万笔，辅助交易部门成功实现稳定高额的回报（日净值 0 回撤）。
</p>
<ul class="org-ul">
<li>实现篮子报单、ETF 折溢价套利单、ETF 期货联动单，使用 Boost.MetaStateMachine 实现</li>
<li>提出高级订单层抽象，为策略层提供高层次的订单原语</li>
<li>正确处理 ETF 套利单中的关于现金替代、涨跌停停牌股票的复杂性</li>
<li>组织开发团队进行单元测试，减少了 70% 的集成测试 bug 数</li>
</ul>
</div>
</div>

<div id="outline-container-org89aa89f" class="outline-3">
<h3 id="org89aa89f"><i>2011.6-2014.6</i>   心电信息管理系统</h3>
<div class="outline-text-3" id="text-org89aa89f">
<p>
系统服务于医院电诊科，用于汇集医疗设备的检查数据，辅助医生做诊断。语言以 C#为主
</p>
<ul class="org-ul">
<li>发现并修复了一个核心通讯协议模块中的内存泄漏问题(全球范围内在用)</li>
<li>通过对用户使用习惯的观察，将报告生成处理改为异步，显著提升用户体验</li>
<li>培训并在组内实行测试驱动开发，后续的迭代周期减少了一半</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc5eef56" class="outline-2">
<h2 id="orgc5eef56"><span class="underline">教育</span></h2>
<div class="outline-text-2" id="text-orgc5eef56">
<ul class="org-ul">
<li><i>2004-2008</i>  上海应用技术大学  机械设计制造及其自动化</li>
<li>在 Coursera, Udacity 上，完成过多个数学、金融、计算机相关课程</li>
</ul>
</div>
</div>

<div id="outline-container-org821c8e9" class="outline-2">
<h2 id="org821c8e9"><span class="underline">语言</span></h2>
<div class="outline-text-2" id="text-org821c8e9">
<ul class="org-ul">
<li>英语 6 级</li>
<li>日语 2 级</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: chrischen</p>
<p class="date">Created: 2018-05-21 Mon 22:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
